{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey",
                "Good morning",
                "Good evening",
                "Is anyone there?",
                "Namaste",
                "Hola",
                "What's up",
                "Howdy",
                "Hi there",
                "Greetings",
                "Hey there",
                "Good afternoon",
                "Morning",
                "Evening",
                "Yo",
                "Sup",
                "Hello there"
            ],
            "responses": [
                "Hello! How can I help you with air quality today?",
                "Hi there! Want to check your local AQI?",
                "Namaste! I am your air quality assistant.",
                "Hey! Ready to help you breathe easier. What would you like to know?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": [
                "Bye",
                "See you later",
                "Goodbye",
                "I'm leaving",
                "Have a Good day",
                "cya",
                "Take care",
                "Catch you later",
                "Farewell",
                "Until next time",
                "Gotta go",
                "I have to leave",
                "Talk to you later",
                "Peace out",
                "Later",
                "Bye bye"
            ],
            "responses": [
                "Sad to see you go. Stay safe!",
                "Goodbye! Remember to check the AQI before going out.",
                "See you later! Breathe easy.",
                "Take care and stay healthy!"
            ]
        },
        {
            "tag": "thanks",
            "patterns": [
                "Thanks",
                "Thank you",
                "That's helpful",
                "Awesome, thanks",
                "Thanks for helping me",
                "Thank you so much",
                "Appreciate it",
                "Thanks a lot",
                "Much appreciated",
                "I appreciate your help",
                "Grateful",
                "Cheers",
                "Thx",
                "Many thanks"
            ],
            "responses": [
                "Happy to help!",
                "Any time!",
                "My pleasure. Stay healthy!",
                "You're welcome! Breathe easy!"
            ]
        },
        {
            "tag": "what_is_aqi",
            "patterns": [
                "What is AQI?",
                "Explain AQI",
                "What does AQI mean?",
                "Define Air Quality Index",
                "Tell me about AQI",
                "AQI definition",
                "What's the Air Quality Index",
                "How does AQI work",
                "AQI meaning",
                "Describe AQI",
                "What is the air quality index",
                "Explain air quality index",
                "What does air quality index measure"
            ],
            "responses": [
                "The Air Quality Index (AQI) is a number used by government agencies to communicate to the public how polluted the air currently is or how polluted it is forecast to become.",
                "AQI stands for Air Quality Index. It tells you how clean or polluted the air is, and what associated health effects might be a concern for you.",
                "The AQI is a standardized indicator of air quality. It runs from 0-500, where higher values indicate worse air quality and greater health concerns."
            ]
        },
        {
            "tag": "what_is_pm25",
            "patterns": [
                "What is PM2.5?",
                "Explain PM2.5",
                "What are fine particles?",
                "PM2.5 meaning",
                "Tell me about PM2.5",
                "What does PM2.5 stand for",
                "Fine particulate matter",
                "PM 2.5 definition",
                "What are fine particulates"
            ],
            "responses": [
                "PM2.5 refers to atmospheric particulate matter (PM) that have a diameter of less than 2.5 micrometers. These fine particles can penetrate deep into the lungs and enter the bloodstream.",
                "PM2.5 are tiny particles in the air that reduce visibility and cause the air to appear hazy when levels are elevated. They are a major concern for health.",
                "PM2.5 are fine inhalable particles with diameters 2.5 micrometers and smaller. They're about 30 times smaller than a human hair!"
            ]
        },
        {
            "tag": "what_is_pm10",
            "patterns": [
                "What is PM10?",
                "Explain PM10",
                "What are coarse particles?",
                "PM10 meaning",
                "Tell me about PM10",
                "PM 10 definition",
                "Coarse particulate matter",
                "What does PM10 stand for"
            ],
            "responses": [
                "PM10 are inhalable particles, with diameters that are generally 10 micrometers and smaller. Examples include dust, pollen, and mold.",
                "PM10 refers to particulate matter 10 micrometers or less in diameter. They can irritate your eyes, nose, and throat.",
                "PM10 are coarse particles that include dust, pollen, and mold spores. While larger than PM2.5, they can still cause respiratory issues."
            ]
        },
        {
            "tag": "health_impacts",
            "patterns": [
                "How does pollution affect health?",
                "Is bad air dangerous?",
                "Health effects of air pollution",
                "Why should I care about AQI?",
                "Can air pollution make me sick?",
                "What are health risks of pollution",
                "Dangers of air pollution",
                "Health problems from air pollution",
                "How does bad air affect me",
                "Air pollution health risks",
                "Is polluted air harmful",
                "Can pollution cause diseases"
            ],
            "responses": [
                "Air pollution can cause respiratory diseases, heart problems, stroke, and lung cancer. Short-term exposure can irritate the eyes, nose, and throat.",
                "High AQI levels can lead to coughing, wheezing, and shortness of breath. Long-term exposure is linked to chronic conditions like asthma and heart disease.",
                "Air pollution affects everyone, but especially children, elderly, and those with existing respiratory conditions. It can reduce lung function and increase hospital admissions."
            ]
        },
        {
            "tag": "precautions_high_aqi",
            "patterns": [
                "What should I do if AQI is high?",
                "Precautions for bad air",
                "How to protect myself from pollution?",
                "Tips for poor air quality",
                "How to stay safe in pollution",
                "Protection from air pollution",
                "What to do when air is bad",
                "Safety measures for high AQI",
                "How to reduce pollution exposure",
                "Steps to protect from pollution",
                "Avoiding air pollution effects"
            ],
            "responses": [
                "Wear a mask (N95/N99), use air purifiers indoors, avoid outdoor exercise, and keep windows closed.",
                "Limit outdoor activities, stay hydrated, and use an air purifier if available. Sensitive groups should stay indoors.",
                "During high AQI days: Stay indoors, use AC with HEPA filters, avoid cooking with gas, and reschedule outdoor activities."
            ]
        },
        {
            "tag": "app_features",
            "patterns": [
                "What can this app do?",
                "Features of Air Aware",
                "How do I use this website?",
                "Show me historical data",
                "What features are available",
                "How does this dashboard work",
                "What can I track here",
                "Dashboard capabilities",
                "Available features",
                "What information can I get"
            ],
            "responses": [
                "Air Aware lets you track real-time AQI, view historical trends, see a map of pollution levels, and get health recommendations.",
                "You can search for any city to get its current Air Quality Index, view pollutant breakdowns (PM2.5, PM10, etc.), and see forecasted trends.",
                "The dashboard provides real-time AQI monitoring, historical data visualization, pollution maps, and personalized health alerts."
            ]
        },
        {
            "tag": "about_creators",
            "patterns": [
                "Who built this?",
                "Who created Air Aware?",
                "About the developers",
                "Who made this app",
                "Who developed this",
                "Team behind this",
                "About the team"
            ],
            "responses": [
                "Air Aware was built to help you stay informed about the air you breathe. We are a team dedicated to raising awareness about air quality.",
                "This project is developed to provide accessible air quality data to everyone.",
                "Our team is passionate about environmental health and created this tool to make air quality information accessible to all."
            ]
        },
        {
            "tag": "common_pollutants",
            "patterns": [
                "What are the main pollutants?",
                "List common air pollutants",
                "What defines the AQI?",
                "Types of air pollutants",
                "Major air pollutants",
                "What pollutants are measured",
                "Common air contaminants",
                "What makes air quality bad"
            ],
            "responses": [
                "The major pollutants are PM2.5, PM10, Ozone (O3), Nitrogen Dioxide (NO2), Sulfur Dioxide (SO2), and Carbon Monoxide (CO).",
                "AQI is calculated based on several pollutants, mainly Particulate Matter (PM2.5 and PM10), Ozone, NO2, SO2, and CO.",
                "Key pollutants monitored include: Particulate Matter (PM2.5, PM10), Ground-level Ozone, Nitrogen Dioxide, Sulfur Dioxide, and Carbon Monoxide."
            ]
        },
        {
            "tag": "aqi_levels",
            "patterns": [
                "What are the AQI levels?",
                "What is a good AQI?",
                "When is AQI dangerous?",
                "AQI scale",
                "AQI categories",
                "AQI ranges",
                "What AQI is safe",
                "What AQI is unhealthy",
                "AQI color codes",
                "Explain AQI levels"
            ],
            "responses": [
                "0-50: Good (Green), 51-100: Moderate (Yellow), 101-150: Unhealthy for Sensitive Groups (Orange), 151-200: Unhealthy (Red), 201-300: Very Unhealthy (Purple), 301+: Hazardous (Maroon).",
                "Good is 0-50. Anything above 100 serves as a warning for sensitive groups, and above 300 is considered hazardous to everyone.",
                "The AQI uses a color-coded system: Green (Good), Yellow (Moderate), Orange (Unhealthy for Sensitive), Red (Unhealthy), Purple (Very Unhealthy), Maroon (Hazardous)."
            ]
        },
        {
            "tag": "ozone",
            "patterns": [
                "What is ozone pollution?",
                "Tell me about ozone",
                "O3 levels",
                "Ground level ozone",
                "Ozone effects",
                "What is O3",
                "Explain ozone pollution"
            ],
            "responses": [
                "Ground-level ozone (O3) is formed when pollutants from vehicles and industry react with sunlight. It can cause breathing problems and aggravate asthma.",
                "Ozone is a major component of smog. While the ozone layer protects us, ground-level ozone is harmful and can damage lung tissue.",
                "O3 forms during hot, sunny days when vehicle emissions react with heat and sunlight. It peaks in summer months and can trigger respiratory issues."
            ]
        },
        {
            "tag": "nitrogen_dioxide",
            "patterns": [
                "What is NO2?",
                "Nitrogen dioxide",
                "Tell me about nitrogen dioxide",
                "NO2 effects",
                "Sources of NO2"
            ],
            "responses": [
                "Nitrogen Dioxide (NO2) is a reddish-brown gas formed from vehicle emissions and power plants. It can irritate airways and worsen asthma.",
                "NO2 comes primarily from vehicle exhaust and industrial processes. High levels can reduce lung function and increase respiratory infections.",
                "Nitrogen dioxide is produced by burning fuel. It contributes to smog formation and can cause breathing difficulties, especially in children."
            ]
        },
        {
            "tag": "sulfur_dioxide",
            "patterns": [
                "What is SO2?",
                "Sulfur dioxide",
                "Tell me about sulfur dioxide",
                "SO2 effects",
                "Sources of sulfur dioxide"
            ],
            "responses": [
                "Sulfur Dioxide (SO2) is produced by burning fossil fuels at power plants and industrial facilities. It can cause breathing problems and aggravate heart disease.",
                "SO2 contributes to acid rain and smog. Short-term exposure can harm the respiratory system, especially for those with asthma.",
                "Sulfur dioxide comes mainly from coal-burning power plants. It can make breathing difficult and worsen existing respiratory conditions."
            ]
        },
        {
            "tag": "carbon_monoxide",
            "patterns": [
                "What is CO?",
                "Carbon monoxide",
                "Tell me about carbon monoxide",
                "CO effects",
                "Carbon monoxide pollution"
            ],
            "responses": [
                "Carbon Monoxide (CO) is a colorless, odorless gas from vehicle exhaust and burning fuel. It reduces oxygen delivery to the body's organs.",
                "CO is particularly dangerous because it's invisible and odorless. High levels can cause dizziness, confusion, and can be fatal.",
                "Carbon monoxide is produced by incomplete combustion of fuels. It's most common near busy roads and can cause headaches and fatigue."
            ]
        },
        {
            "tag": "children_safety",
            "patterns": [
                "Is pollution bad for children?",
                "Children and air quality",
                "How does pollution affect kids",
                "Protecting children from pollution",
                "Kids safety in bad air",
                "Children health and air pollution"
            ],
            "responses": [
                "Children are especially vulnerable to air pollution because their lungs are still developing and they breathe more air per pound of body weight than adults.",
                "Protect children by limiting outdoor play when AQI is above 100, keeping them hydrated, and using air purifiers at home.",
                "Kids breathe faster and are more active outdoors, increasing their pollution exposure. High AQI can trigger asthma attacks and affect lung development."
            ]
        },
        {
            "tag": "elderly_safety",
            "patterns": [
                "Elderly and air pollution",
                "How does pollution affect elderly",
                "Senior citizens and air quality",
                "Protecting elderly from pollution",
                "Old age and bad air"
            ],
            "responses": [
                "Elderly people are at higher risk from air pollution due to weakened immune systems and pre-existing health conditions like heart disease.",
                "Seniors should stay indoors when AQI is high, take medications as prescribed, and monitor symptoms closely.",
                "Older adults are more susceptible to pollution's effects on the heart and lungs. They should avoid outdoor activities during poor air quality days."
            ]
        },
        {
            "tag": "exercise_pollution",
            "patterns": [
                "Can I exercise in pollution?",
                "Working out in bad air",
                "Exercise and air quality",
                "Should I run when AQI is high",
                "Outdoor exercise safety",
                "Gym vs outdoor exercise pollution"
            ],
            "responses": [
                "Avoid outdoor exercise when AQI is above 150. If you must exercise, do it early morning or late evening when pollution is lower, and reduce intensity.",
                "Exercise indoors when air quality is poor. If outdoors, avoid high-traffic areas and peak traffic hours.",
                "During exercise you breathe deeper and faster, inhaling more pollutants. Switch to indoor workouts when AQI exceeds 100 if you're in a sensitive group."
            ]
        },
        {
            "tag": "masks",
            "patterns": [
                "What mask should I wear?",
                "Do masks help with pollution?",
                "N95 mask for pollution",
                "Best mask for air quality",
                "Surgical mask vs N95",
                "Mask effectiveness pollution"
            ],
            "responses": [
                "N95 or N99 masks are effective against PM2.5. Surgical masks offer limited protection. Ensure proper fit for maximum effectiveness.",
                "For pollution protection, use masks rated N95, N99, or FFP2/FFP3. They filter out at least 95% of particles including PM2.5.",
                "Regular cloth masks don't protect against pollution. Use certified N95/N99 masks and ensure they seal properly around your face."
            ]
        },
        {
            "tag": "air_purifiers",
            "patterns": [
                "Do air purifiers work?",
                "Best air purifier",
                "How to choose air purifier",
                "HEPA filter",
                "Indoor air quality",
                "Air purifier effectiveness"
            ],
            "responses": [
                "Air purifiers with HEPA filters can remove 99.97% of particles including PM2.5. Choose one sized appropriately for your room.",
                "Look for air purifiers with True HEPA filters and activated carbon. Check the CADR rating - higher is better for larger rooms.",
                "Yes, air purifiers work! Use them in bedrooms and main living areas. Keep doors/windows closed and run continuously for best results."
            ]
        },
        {
            "tag": "sources_pollution",
            "patterns": [
                "What causes air pollution?",
                "Sources of air pollution",
                "Where does pollution come from",
                "Main pollution sources",
                "Why is air polluted",
                "Causes of bad air quality"
            ],
            "responses": [
                "Major sources include vehicle emissions, industrial activities, power plants, construction, burning of crops, and household cooking with biomass fuels.",
                "Air pollution comes from traffic, factories, coal power plants, waste burning, construction dust, and natural sources like wildfires and dust storms.",
                "Urban pollution is mainly from vehicles and industries. In some areas, crop burning, brick kilns, and residential heating contribute significantly."
            ]
        },
        {
            "tag": "seasonal_pollution",
            "patterns": [
                "Why is winter pollution worse?",
                "Seasonal air quality",
                "Pollution in different seasons",
                "Summer vs winter pollution",
                "When is air quality worst"
            ],
            "responses": [
                "Winter pollution is often worse due to temperature inversion, heating emissions, and crop burning. Cold air traps pollutants near the ground.",
                "Pollution varies by season. Winter has higher PM levels due to heating and trapped air. Summer sees more ozone formation from heat and sunlight.",
                "In many regions, air quality worsens in winter due to crop burning, increased heating needs, and weather conditions that trap pollutants."
            ]
        },
        {
            "tag": "indoor_outdoor",
            "patterns": [
                "Indoor vs outdoor air quality",
                "Is indoor air safer?",
                "Indoor pollution sources",
                "How to improve indoor air",
                "Indoor air quality tips"
            ],
            "responses": [
                "Indoor air can be 2-5 times more polluted than outdoor air. Sources include cooking, cleaning products, and poor ventilation. Use air purifiers and proper ventilation.",
                "Improve indoor air by avoiding smoking indoors, using exhaust fans while cooking, maintaining AC filters, and using air purifiers during high outdoor AQI.",
                "Indoor pollution comes from cooking fumes, incense, cleaning chemicals, and outdoor pollution entering through windows. Keep indoor plants and use HEPA purifiers."
            ]
        },
        {
            "tag": "pregnancy_pollution",
            "patterns": [
                "Pregnancy and air pollution",
                "Is pollution bad for pregnancy",
                "Pregnant women and air quality",
                "Air pollution effects on fetus",
                "Protecting pregnancy from pollution"
            ],
            "responses": [
                "Air pollution during pregnancy can affect fetal development and birth weight. Pregnant women should minimize exposure, especially in the first trimester.",
                "Expectant mothers should stay indoors when AQI is high, use air purifiers at home, and avoid areas with heavy traffic.",
                "Studies link air pollution exposure during pregnancy to preterm birth and low birth weight. Take extra precautions and monitor air quality daily."
            ]
        },
        {
            "tag": "asthma",
            "patterns": [
                "Asthma and air pollution",
                "Air quality for asthma patients",
                "Pollution triggers asthma",
                "Asthma precautions",
                "Managing asthma in pollution"
            ],
            "responses": [
                "Air pollution is a major asthma trigger. Asthmatics should stay indoors when AQI exceeds 100, keep rescue inhalers handy, and use preventive medication as prescribed.",
                "For asthma patients: monitor AQI daily, avoid outdoor activities during high pollution, use air purifiers, and follow your asthma action plan closely.",
                "Pollution can trigger asthma attacks. Track your peak flow, take controller medications regularly, and seek medical attention if symptoms worsen."
            ]
        },
        {
            "tag": "plants_air_quality",
            "patterns": [
                "Do plants improve air quality?",
                "Indoor plants for air",
                "Best air purifying plants",
                "Plants that clean air",
                "Natural air purification"
            ],
            "responses": [
                "Indoor plants can help improve air quality by absorbing CO2 and some pollutants. Snake plants, spider plants, and peace lilies are particularly effective.",
                "While plants do clean air, you'd need many to match an air purifier's effectiveness. They're great additions but shouldn't be your only solution.",
                "Plants like Areca Palm, Money Plant, and Aloe Vera can improve indoor air quality. Place several in each room for best results."
            ]
        },
        {
            "tag": "weather_pollution",
            "patterns": [
                "How does weather affect air quality?",
                "Wind and pollution",
                "Rain and air quality",
                "Weather impact on pollution",
                "Does rain clean air"
            ],
            "responses": [
                "Rain helps wash pollutants from the air. Wind can disperse pollution but also carry it from other areas. Calm, stagnant conditions trap pollution.",
                "Temperature inversions in winter trap pollutants near ground level. Windy conditions help disperse pollution, while rain provides temporary relief.",
                "Weather significantly impacts air quality. Rain and wind improve it, while temperature inversions and calm conditions worsen pollution."
            ]
        },
        {
            "tag": "check_aqi",
            "patterns": [
                "What's the current AQI?",
                "Check air quality",
                "How's the air today?",
                "Show me AQI",
                "Current air quality",
                "Today's air quality",
                "Is air quality good today",
                "Air pollution level now"
            ],
            "responses": [
                "Please use the dashboard to check the current AQI for your location. You can search for your city in the search bar.",
                "You can view real-time AQI data on the dashboard. Just enter your city name or enable location access.",
                "Check the main dashboard for current AQI readings. The map view also shows pollution levels across different areas."
            ]
        },
        {
            "tag": "forecast",
            "patterns": [
                "Air quality forecast",
                "Tomorrow's AQI",
                "AQI prediction",
                "Will air quality improve",
                "Future air quality",
                "Pollution forecast"
            ],
            "responses": [
                "Check the forecast tab on the dashboard for predicted AQI levels for the next few days.",
                "Air quality forecasts are available on the dashboard. They help you plan outdoor activities in advance.",
                "The dashboard provides 3-7 day air quality forecasts based on weather patterns and pollution trends."
            ]
        },
        {
            "tag": "location_specific",
            "patterns": [
                "AQI in my city",
                "Air quality in Delhi",
                "How's air in Mumbai",
                "Pollution in Bangalore",
                "Check AQI for specific location",
                "Air quality near me"
            ],
            "responses": [
                "Use the search function on the dashboard to check AQI for any city. You can also enable location access for automatic local updates.",
                "Enter your city name in the search bar to get location-specific air quality data and recommendations.",
                "The dashboard supports air quality data for cities worldwide. Just type in the location you want to check."
            ]
        },
        {
            "tag": "data_source",
            "patterns": [
                "Where does data come from?",
                "Data sources",
                "How accurate is this data",
                "Who provides AQI data",
                "Are readings accurate",
                "Data reliability"
            ],
            "responses": [
                "Our data comes from government monitoring stations and verified air quality networks to ensure accuracy and reliability.",
                "We aggregate data from official environmental monitoring agencies and real-time sensor networks.",
                "Air quality data is sourced from certified monitoring stations and updated regularly to provide accurate, real-time information."
            ]
        },
        {
            "tag": "alerts",
            "patterns": [
                "Set up alerts",
                "Notification settings",
                "Alert me when AQI is high",
                "How to get alerts",
                "AQI notifications",
                "Warning system"
            ],
            "responses": [
                "You can set up personalized AQI alerts in the settings menu. Get notifications when air quality reaches your specified threshold.",
                "Enable notifications to receive alerts when AQI levels become unhealthy in your area.",
                "Customize alert settings to get notified about poor air quality, allowing you to take precautions in advance."
            ]
        },
        {
            "tag": "historical_data",
            "patterns": [
                "Historical air quality data",
                "Past AQI trends",
                "Air quality history",
                "Show historical data",
                "AQI trends",
                "Long term pollution data"
            ],
            "responses": [
                "Access historical air quality data through the dashboard's history tab. View trends over days, months, or years.",
                "The dashboard archives historical AQI data, allowing you to analyze pollution patterns and seasonal variations.",
                "Historical data helps identify long-term trends. You can view past AQI levels and compare them with current conditions."
            ]
        },
        {
            "tag": "comparison",
            "patterns": [
                "Compare cities",
                "Which city has better air",
                "Compare air quality",
                "City comparison",
                "AQI comparison"
            ],
            "responses": [
                "Use the comparison feature to view air quality across multiple cities side by side.",
                "The dashboard allows you to compare AQI levels between different locations to help with travel or relocation decisions.",
                "Compare cities to see which areas have better air quality. This feature is useful for planning trips or considering relocations."
            ]
        }
    ]
}